app/controllers/blog_controller.rb

  def index
  	@articles = Article.all;
---
SELECT "articles".* FROM "articles" ORDER BY "articles".title ASC

  def show
  	if(params[:article_id] != nil)
  		@article = Article.find(params[:article_id]);
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]