app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    article  = Article.find(session[:current_article_id])
    article.add_comment(@comment)
    respond_to do |format|
      if @comment.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("article_id", "created_at", "description", "mail", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)  [["article_id", 1], ["created_at", Tue, 29 Apr 2014 12:12:49 UTC +00:00], ["description", ""], ["mail", ""], ["updated_at", Tue, 29 Apr 2014 12:12:49 UTC +00:00], ["user", ""]]