app/views/blog/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [[nil, 1]]
---
    <h3>COMMENTS</h3>
     <% @article.comments.each do |comment| %>